"""
Спортсмен занимается ежедневными пробежками.
В первый день его результат составил a километров.
Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
Требуется определить номер дня, на который
общий результат спортсмена составить не менее b километров.
Программа должна принимать значения параметров a и b
и выводить одно натуральное число — номер дня.
Например: a = 2, b = 3.
Результат:
1-й день: 2
2-й день: 2,2
3-й день: 2,42
4-й день: 2,66
5-й день: 2,93
6-й день: 3,22

Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.
"""
first_day = input('Сколько километров спортсмен пробежал за 1-й день: \n')
print('В первый день спортсмен пробежал {} км'.format(first_day))
while True:
    if first_day.isdigit():
        first_day = int(first_day)
        break
    else:
        print('Ошибка ввода. Это не число.')
last_day = input('Результат спортсмена, к которому он стремится в км: \n')
while True:
    if last_day.isdigit():
        last_day = int(last_day)
    break
day = 1
tmp = first_day

while tmp <= last_day:
    tmp *= 1.1
    day += 1
print('Ответ: \n на {}-й день спортсмен достигнет желаемого результата!'.format(day))